tutorials/incompressible/simpleFoam/mixingPlaneAxial/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    outflow
    {
        type            zeroGradient;
    }
    inflow
    {
        type            fixedValue;
        value           uniform 0.1;
    }
    upstreamPerio1
    {
        type            cyclicGgi;
        value           uniform 0.1;
    }
    upstreamPerio2
    {
        type            cyclicGgi;
        value           uniform 0.1;
    }
    upstreamMixingPlanePatch
    {
        type            mixingPlane;
        value           uniform 0.1;
    }
    downstreamMixingPlanePatch
    {
        type            mixingPlane;
        value           uniform 0.1;
    }
    downstreamWall
    {
        type            symmetryPlane;
    }
    upstreamWall
    {
        type            symmetryPlane;
    }
    downstreamPerio1
    {
        type            cyclicGgi;
        value           uniform 0.1;
    }
    downstreamPerio2
    {
        type            cyclicGgi;
        value           uniform 0.1;
    }
}

// ************************************************************************* //
